Tekla Open API Reference for Tekla Structures 2025
Operation.IsNumberingUpToDate Method
 Checks whether the numbering is up-to-date for an assembly, part, rebar, surface treatment, pour object or break.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool IsNumberingUpToDate(
	ModelObject InputModelObject
)
Public Shared Function IsNumberingUpToDate (
	InputModelObject As ModelObject
) As Boolean
Parameters
InputModelObject
Type: Tekla.Structures.Model.ModelObject
The model object to check. The object must be an assembly, a part, a rebar or an inherited object.
Return Value
Type: Boolean
True if the numbering information is up-to-date.
Exceptions
Exception | Condition
ArgumentException | Thrown if the InputModelObject is not of a correct type or if it is not valid.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace